chengxunming/L50TE-MAUe/L50T-MAU/L50T-MAU/L50T-MAU/src/LPC2294.inc
;/* Pulse Width Modulator (PWM) */
;/* 脉宽调制器的特殊寄存器 */
PWMIR           EQU         0xE0014000
PWMTCR          EQU         0xE0014004
PWMTC           EQU         0xE0014008
PWMPR           EQU         0xE001400C
PWMPC           EQU         0xE0014010
PWMMCR          EQU         0xE0014014
PWMMR0          EQU         0xE0014018
PWMMR1          EQU         0xE001401C
PWMMR2          EQU         0xE0014020
PWMMR3          EQU         0xE0014024
PWMMR4          EQU         0xE0014040
PWMMR5          EQU         0xE0014044
PWMMR6          EQU         0xE0014048
PWMPCR          EQU         0xE001404C
PWMLER          EQU         0xE0014050

;/* A/D CONVERTER */
;/* A/D转换器 */
ADCR            EQU         0xE0034000          ;/* no in lpc210x*/
ADDR            EQU         0xE0034004          ;/* no in lpc210x*/

;/* for lpc2138 */
AD0CR           EQU         0xE0034000      
AD0DR           EQU         0xE0034004      
ADGSM           EQU         0xE0034008      
AD1CR           EQU         0xE0060000      
AD1DR           EQU         0xE0060004      

;/* for lpc2103 */
AD0GDR			    EQU         0xE0034004	
AD0STAT			    EQU         0xE0034030	
AD0INTEN	    	EQU         0xE003400C	
AD0DR0		    	EQU         0xE0034010	
AD0DR1			    EQU         0xE0034014	
AD0DR2			    EQU         0xE0034018	
AD0DR3			    EQU         0xE003401C	
AD0DR4			    EQU         0xE0034020	
AD0DR5			    EQU         0xE0034024	
AD0DR6			    EQU         0xE0034028	
AD0DR7			    EQU         0xE003402C	

;/* D/A CONVERTER */
;/* D/A转换器 */
DACR  			    EQU         0xE006C000          ;/* lpc2138 only */

;/* Real Time Clock */
;/* 实时时钟的特殊寄存器 */
ILR            EQU          0xE0024000
CTC            EQU          0xE0024004
CCR            EQU          0xE0024008
CIIR           EQU          0xE002400C
AMR            EQU          0xE0024010
CTIME0         EQU          0xE0024014
CTIME1         EQU          0xE0024018
CTIME2         EQU          0xE002401C
SEC            EQU          0xE0024020
MIN            EQU          0xE0024024
HOUR           EQU          0xE0024028
DOM            EQU          0xE002402C
DOW            EQU          0xE0024030
DOY            EQU          0xE0024034
MONTH          EQU          0xE0024038
YEAR           EQU          0xE002403C
ALSEC          EQU          0xE0024060
ALMIN          EQU          0xE0024064
ALHOUR         EQU          0xE0024068
ALDOM          EQU          0xE002406C
ALDOW          EQU          0xE0024070
ALDOY          EQU          0xE0024074
ALMON          EQU          0xE0024078
ALYEAR         EQU          0xE002407C
PREINT         EQU          0xE0024080
PREFRAC        EQU          0xE0024084

;/* Watchdog */
;/* 看门狗的特殊寄存器 */
WDMOD          EQU          0xE0000000
WDTC           EQU          0xE0000004
WDFEED         EQU          0xE0000008
WDTV           EQU          0xE000000C

;/* Define firmware Functions Addr*/
;/* 定义固件函数地址 */
rm_init_entry               EQU         0x7fffff91
rm_undef_handler            EQU         0x7fffffa0
rm_prefetchabort_handler    EQU         0x7fffffb0
rm_dataabort_handler        EQU         0x7fffffc0
rm_irqhandler               EQU         0x7fffffd0
rm_irqhandler2              EQU         0x7fffffe0
iap_entry                   EQU         0x7ffffff1

    end
;/*********************************************************************************************************
;**                            End Of File
;********************************************************************************************************/
